n = int(input())
# 2 3 3 4 4 4 5 5 5  5  6  6  6  6  6
# 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15
# 바뀌는 지점 1, 2, 4, 7, 11, 16
#   이것의 순열 1, 2, 3, 4, 5

# 만약 내가 14를 받았다 11과 16사이 -> 6임
# 14-11 = 3이므로 1+3 = 4, 16-11-3=2 이므로 2/4 임

arr = []
temp = 1
count = 1
# 1, / 1, 2, / 3, 2, 1, / 1, 2, 3, 4,/ 5, 4, 3, 2, 1
# 1, / 2, 1, / 1, 2, 3, / 4, 3, 2, 1 / 1, 2, 3, 4, 5 / 
# 2, / 3, 3, / 4, 4, 4, / 5, 5, 5, 5,/ 6, 6, 6, 6, 6
while True:
    if temp > n:
        break
    temp += count
    count += 1
prev_temp = temp - count + 1
a = temp - n
b = n-prev_temp+1
if count % 2 == 0:
    print(f"{a}/{b}")
else:
    print(f"{b}/{a}")
